# Є набір чисел (float або int). Вам потрібно знайти різницю між найбільшим (максимум)
# і найменшим (мінімум) елементом. Ваша функція difference має вміти працювати з невизначеною кількістю аргументів.
# Якщо аргументів немає, то функція повертає 0 (нуль).
# Якщо з 3-м тестом будуть проблеми, використовуйте функцію округлення round(x, 2),
# де х це число, яке потрібно округлити.
# Вх. Дані: Змінна кількість аргументів як числа (int, float).
# Вих. Дані: Різниця між максимумом і мінімумом як число (int, float).
#*args позволяет функции принимать любое количество чисел:
# нап
# if not args: — проверяем, есть ли вообще числа. Если нет → возвращаем 0
# max(args) — находим максимальное число
# min(args) — находим минимальное
# round(result, 2) — округляем результат до 2 знаков после запятой
# (чтобы прошёл тест с 12.4)
# Приклади:

def difference(*args):
    if not args:  # если аргументов нет
        return 0

    # разница между максимумом и минимумом
    result = max(args) - min(args)
    return round(result, 2)  # округляем до 2 знаков после запятой


# Тесты
assert difference(1, 2, 3) == 2, 'Test1'
assert difference(5, -5) == 10, 'Test2'
assert difference(10.2, -2.2, 0, 1.1, 0.5) == 12.4, 'Test3'
assert difference() == 0, 'Test4'
print('OK')

