# Завдання ускладнюється.
# Ваша функція is_even, як і раніше, повинна повертати True якщо число парне, або False якщо число непарне, але при цьому НЕ МОЖНА використовувати ділення у функції, та дії пов'язані з ним. Тобто. заборонено використовувати /, //, % та divmod
# Складність ще полягає і в тому, щоб знайти рішення, яке не залежало б від розміру числа :)
# Вхідні дані: Ціле число.
# Вихідні дані: True або False

def is_even(number: int) -> bool:
    return (number & 1) == 0

assert is_even(2494563894038**2) == True, 'Test1'
assert is_even(1056897**2) == False, 'Test2'
assert is_even(24945638940387**3) == False, 'Test3'

print("OK")

# number & 1 → дає 1, якщо число непарне, і 0, якщо парне
# not робить навпаки:
# not 0 → True (парне)
# not 1 → False (непарне)
# Перевірка парності виконується за допомогою бітової операції AND.
# У двійковому вигляді всі парні числа закінчуються на 0, а непарні — на 1.
# Тому number & 1 дорівнює 0 для парних чисел і 1 для непарних.
# Це дозволяє визначати парність без використання ділення.

