# Ваша функція is_even повинна повертати True якщо число парне, і False якщо число непарне.
# Вхідні дані: Ціле число.
# Вихідні дані: Логічний тип.

def is_even(digit: int) -> bool:
    """Перевірка чи є число парним"""
    return digit % 2 == 0

assert is_even(2) == True, 'Test1'
assert is_even(5) == False, 'Test2'
assert is_even(0) == True, 'Test3'
print('OK')


# ********* для себя памятка:
# # 📎 Що робить функція?
# # Функція is_even приймає одне ціле число та визначає, чи є воно парним.
# # Парне число — це те, що ділиться на 2 без остачі.
# # 📎 Як працює?
# # Використовується оператор % (остача від ділення).
# # Якщо digit % 2 == 0, число парне → повертаємо True.
# # Якщо остача не 0 — число непарне → повертаємо False.
# # 📎 Приклади:
# # 2 % 2 = 0 → парне
# # 5 % 2 = 1 → непарне
# # 0 % 2 = 0 → парне (нуль завжди парний)
# # 📎 Аннотація типів
# # digit: int — вхідне значення — ціле число
# # -> bool — функція повертає логічний тип True/False