# Ваше завдання — написати програму, яка перемножує всі цифри, введені користувачем цілого числа,
# поки воно не стане менше або дорівнювати 9.
# Користувач вводить число з клавіатури.
# Приклади: 999 -> 2 # Ось чому - 999 розбиваємо на цифри і перемножуємо 9 * 9 * 9 = 729,
# Потім 7 * 2 * 9 = 126, потім 1 * 2 * 6 = 12 і в результаті 1 * 2 = 2
# 1000 -> 0
# 423 -> 8
# 33 -> 9
# 25 -> 0
# 1 -> 1

while True:
    n = int(input("Введите любое целое число: "))

    while n > 9:
        x = 1
        for d in str(n):
            x *= int(d)
        n = x

    print("Результат:", n)

    again = input("Хотите продолжить? (y/n): ")
    if again.lower() != "y":   # если пользователь не ввёл y
        print("Дякую, робота завершена")
        break

