# Напишіть функцію-генератор generate_cube_numbers, яка формує набір кубів чисел,
# починаючи з числа 2 до вказаної Вами величини. Тобто. генератор повинен працювати доти,
# поки генерується значення менше зазначеної величини.
# Нагадую, що вийти із генератора можна за допомогою return без параметрів.

from typing import Generator

def generate_cube_numbers(end: int) -> Generator[int, None, None]:
    """Генератор кубів чисел від 2, поки cube <= end."""

    num = 2
    while True:
        cube = num ** 3
        if cube > end:
            return  # завершуємо генератор
        yield cube
        num += 1


from inspect import isgenerator

gen = generate_cube_numbers(1)
assert isgenerator(gen) == True, 'Test0'
assert list(generate_cube_numbers(10)) == [8], 'оскільки воно менше 10.'
assert list(generate_cube_numbers(100)) == [8, 27, 64], '5 у кубі це 125, а воно вже більше 100'
assert list(generate_cube_numbers(1000)) == [8, 27, 64, 125, 216, 343, 512, 729, 1000], '10 у кубі це 1000'
print("OK")


# 📌 Як працює генератор generate_cube_numbers?
# Початкове число встановлюємо num = 2 (бо починаємо саме з 2³ = 8).
# У циклі while True обчислюємо cube = num ** 3.
# Якщо куб більший за end, генератор завершує роботу через return.
# Якщо значення підходить → передається yield.
# Збільшуємо num на 1 і продовжуємо цикл.
# 📌 Чому використовується return?
# У генераторі return без значення означає:
#  "завершити генерацію"
#  "вихід без винятків"

