# ДЗ_3.1Програма має виконувати прості математичні дії (+, -, *, /). Користувачеві пропонується почерзі ввести числа та дію над цими числами, а програма, виходячи з дії, обчислює та друкує результат.
# Зробити перевірку на те, що при діленні дільник не дорівнює 0!
# Програма виконує прості математичні дії: +, -, *, /

# Введення даних
num1 = float(input("Введите число: "))
operation = input("выбрать действие (+, -, *, /): ")
num2 = float(input("Введите число: "))

# программа вычесления
if operation == '+':
    result = num1 + num2
    print("Результат:", result)

elif operation == '-':
    result = num1 - num2
    print("Результат:", result)

elif operation == '*':
    result = num1 * num2
    print("Результат:", result)

#проверка деление на ноль если проверка прошла успешно выводим результат
elif operation == '/':
    if num2 == 0:
        print("ERROR: делить на НОЛЬ нельзя!")
    else:
        result = num1 / num2
        print("Результат:", result)
# если выбран не правельный знак, выводим в консоль
else:
    print("ERROR, нужно выбрать один из предложенных знаков  +, -, *, /")
