# Д.З 4.1
# Написати програму, яка переміщає всі нулі у кінець списку.
# Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
# Порядок ненульових чисел має зберегтися!
# Приклад:

# [0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
# [0] -> [0]
# [1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
# [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

# ******* решение
# [x for x in lst if x != 0] — создаем новый список, без нулей.
# [0] * (len(lst) - len(non_zero)) — формирует список из нужного количества нулей, чтобы вернуть исходную длину.
# non_zero + zeros — объединяет оба списка: сначала числа, потом нули.

def move_zeros(lst):
    # создаём список без нулей
    non_zero = [x for x in lst if x != 0]
    # добавляем нужное количество нулей в конец
    zeros = [0] * (len(lst) - len(non_zero))
    # возвращаем объединённый список
    return non_zero + zeros

print(move_zeros([0, 1, 0, 12, 3]))
print(move_zeros([0]))
print(move_zeros([1, 0, 13, 0, 0, 0, 5]))
print(move_zeros([9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]))

